wrk/futures_res/wrk_put.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 1.599ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.982ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.984ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.616ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.24ms    1.14ms  26.21ms   97.13%
    Req/Sec     1.40k   575.12     5.00k    64.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.10ms
 75.000%    1.38ms
 90.000%    1.64ms
 99.000%    6.51ms
 99.900%   15.82ms
 99.990%   24.05ms
 99.999%   26.13ms
100.000%   26.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.240     0.000000            1         1.00
       0.610     0.100000         9916         1.11
       0.757     0.200000        19837         1.25
       0.876     0.300000        29688         1.43
       0.990     0.400000        39582         1.67
       1.103     0.500000        49453         2.00
       1.157     0.550000        54449         2.22
       1.211     0.600000        59374         2.50
       1.265     0.650000        64354         2.86
       1.319     0.700000        69266         3.33
       1.378     0.750000        74243         4.00
       1.409     0.775000        76666         4.44
       1.443     0.800000        79132         5.00
       1.481     0.825000        81589         5.71
       1.524     0.850000        84075         6.67
       1.576     0.875000        86565         8.00
       1.606     0.887500        87781         8.89
       1.643     0.900000        89037        10.00
       1.683     0.912500        90242        11.43
       1.730     0.925000        91478        13.33
       1.793     0.937500        92730        16.00
       1.835     0.943750        93346        17.78
       1.887     0.950000        93951        20.00
       1.953     0.956250        94576        22.86
       2.063     0.962500        95192        26.67
       2.275     0.968750        95808        32.00
       2.427     0.971875        96114        35.56
       2.689     0.975000        96423        40.00
       3.155     0.978125        96732        45.71
       3.751     0.981250        97041        53.33
       4.547     0.984375        97350        64.00
       5.035     0.985938        97505        71.11
       5.531     0.987500        97659        80.00
       6.095     0.989062        97816        91.43
       6.767     0.990625        97968       106.67
       7.679     0.992188        98123       128.00
       8.091     0.992969        98202       142.22
       8.447     0.993750        98277       160.00
       8.927     0.994531        98356       182.86
       9.431     0.995313        98432       213.33
      10.223     0.996094        98509       256.00
      10.671     0.996484        98549       284.44
      11.063     0.996875        98586       320.00
      11.639     0.997266        98627       365.71
      12.223     0.997656        98664       426.67
      12.903     0.998047        98702       512.00
      13.663     0.998242        98722       568.89
      14.047     0.998437        98741       640.00
      14.551     0.998633        98760       731.43
      15.183     0.998828        98780       853.33
      15.903     0.999023        98799      1024.00
      16.375     0.999121        98809      1137.78
      16.623     0.999219        98819      1280.00
      16.911     0.999316        98828      1462.86
      17.215     0.999414        98838      1706.67
      18.111     0.999512        98847      2048.00
      18.527     0.999561        98852      2275.56
      19.263     0.999609        98857      2560.00
      19.679     0.999658        98862      2925.71
      20.575     0.999707        98867      3413.33
      20.863     0.999756        98871      4096.00
      21.583     0.999780        98874      4551.11
      21.791     0.999805        98876      5120.00
      23.263     0.999829        98879      5851.43
      23.647     0.999854        98881      6826.67
      24.031     0.999878        98884      8192.00
      24.047     0.999890        98885      9102.22
      24.239     0.999902        98886     10240.00
      24.335     0.999915        98887     11702.86
      24.431     0.999927        98889     13653.33
      24.431     0.999939        98889     16384.00
      24.479     0.999945        98890     18204.44
      25.407     0.999951        98891     20480.00
      25.407     0.999957        98891     23405.71
      25.647     0.999963        98892     27306.67
      25.647     0.999969        98892     32768.00
      25.871     0.999973        98893     36408.89
      25.871     0.999976        98893     40960.00
      25.871     0.999979        98893     46811.43
      26.127     0.999982        98894     54613.33
      26.127     0.999985        98894     65536.00
      26.127     0.999986        98894     72817.78
      26.127     0.999988        98894     81920.00
      26.127     0.999989        98894     93622.86
      26.223     0.999991        98895    109226.67
      26.223     1.000000        98895          inf
#[Mean    =        1.239, StdDeviation   =        1.144]
#[Max     =       26.208, Total count    =        98895]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  176934 requests in 30.00s, 11.31MB read
  Socket errors: connect 7, read 0, write 0, timeout 5574
  Non-2xx or 3xx responses: 293
Requests/sec:   5898.24
Transfer/sec:    386.00KB